In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv("https://raw.githubusercontent.com/mingchang0804/python_notebook/master/BA501_python_data.csv")

# How do you handle duplicate values in a dataset in Python?

Ans:use pandas drop_duplicates method

For example:

In [3]:
data = data.drop_duplicates()

In [4]:
data.head()

,country,date,experiment_id,order_id,spend_usd,user_id,vertical
0,JP,20170402,12624548,5813140433216629693,16.138855,5006730028073359543,ANDROID_APPS
1,US,20170403,12624549,16333056276711034931,9.990000,5938685669571545259,ANDROID_APPS
2,JP,20170404,12624548,11227119161741298366,19.887087,17623708458399141713,ANDROID_APPS
3,US,20170403,12624548,11927299833124210932,19.990000,18042812344456618148,ANDROID_APPS
4,JP,20170403,12624549,11644727017708872749,88.220093,4325104700699531031,ANDROID_APPS

In [6]:
data.shape[0]

73910

# You are given two tables - friend_request and request_accepted. Friend_request contains requester_id, time and sent_to_id and request_accepted table contains time, acceptor_id and requestor_id. How will you determine the overall acceptance rate of requests?

## SQL

Assume that same id sends multiple requests to indentical id should be consider as only one request.

%%sql
SELECT requester_id,sent_to_id
INTO temp
From friend_request
Group by 1,2;

%%sql
SELECT count(*) as total_request
FROM temp

→result1

%%sql
SELECT count(*) as total_accept
FROM request_accepted t1
Inner Join temp t2
 ON t1.acceptor_id=t2.sent_to_id AND t1.requestor_id=t2.requester_id;
 
→result2

So, overall acceptance rate of requests = result1/result2

## Python pandas

friend_request = friend_request.drop_duplicates(subset=["requester_id", "sent_to_id"])##remove duplicated request

request_accepted.columns = ["requester_id", "sent_to_id"]

request_accepted = pd.merge(friend_request,request_accepted, on = ["requester_id", "sent_to_id"]) ## inner join to remove wrong reords in request_accepted table

accepted rate = request_accepted.shape[0]/friend_request.shape[0]

# “Issuer” of a credit card are companies like Visa, Mastercard, American Express. Now we know the following rules:

CC number starts with: '4'
CC len : 16
Issuer: VISA

CC number starts with: '34', '37'
CC len : 15
Issuer : AMEX

CC number starts with: '36'
CC len : 14
Issuer : Diners Club

Credit card number starts with
'4026', '417500', '4405', '4508', '4844',
'4913', '4917'
CC len : 16
Issuer : VISAELECTRON

Now write Python scripts to identify the issuer of the following credit card numbers:

'4175004175004172' 
'4917491749174917'
'346416800707698'
'376416800707698'
'37641680070769832112'
'36641680070769'
'54545641680070769’

In [7]:
data = ['4175004175004172','4917491749174917'
,'346416800707698'
,'376416800707698'
,'37641680070769832112'
,'36641680070769'
,'54545641680070769']

In [8]:
VISAELECTRON = ['4026', '417500', '4405', '4508', '4844', '4913', '4917']

In [9]:
data = pd.DataFrame(data)

In [10]:
data.columns = ["number"]

In [11]:
data

                 number
0      4175004175004172
1      4917491749174917
2       346416800707698
3       376416800707698
4  37641680070769832112
5        36641680070769
6     54545641680070769

In [18]:
VISAELECTRON = ['4026', '417500', '4405', '4508', '4844', '4913', '4917']

def issuer(num):
    ret ="Not a standard card"
    if num.startswith('4')&(len(num)==16):
        result = num.startswith(VISAELECTRON[0])
        for i in range(1,len(VISAELECTRON)):
            result = result| num.startswith(VISAELECTRON[i])
        if result&(len(num)==16) == True:
            ret = "VISAELECTRON"
        else:
            ret = "visa"
    elif (num.startswith('34')|num.startswith('37'))&(len(num)==15):
            ret = "AMEX"
    elif num.startswith('36')&(len(num)==14):
            ret = "Diners Club"
    return ret

In [19]:
data.number.apply(lambda x:issuer(x)).to_frame()

                number
0         VISAELECTRON
1         VISAELECTRON
2                 AMEX
3                 AMEX
4  Not a standard card
5          Diners Club
6  Not a standard card